results/results_m5_large/results_m5_large_run1/oltp_read_write_t4/sysbench.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 17.40 qps: 352.93 (r/w/o: 247.35/19.00/86.58) lat (ms,95%): 601.29 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 14.70 qps: 295.41 (r/w/o: 207.21/16.40/71.80) lat (ms,95%): 559.50 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 21.30 qps: 424.10 (r/w/o: 296.70/23.90/103.50) lat (ms,95%): 442.73 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 10.20 qps: 204.40 (r/w/o: 143.20/10.50/50.70) lat (ms,95%): 1089.30 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 7.00 qps: 140.20 (r/w/o: 98.30/7.40/34.50) lat (ms,95%): 995.51 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 11.90 qps: 238.40 (r/w/o: 167.20/12.70/58.50) lat (ms,95%): 802.05 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 4 tps: 20.40 qps: 407.10 (r/w/o: 284.70/21.90/100.50) lat (ms,95%): 539.71 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 4 tps: 33.50 qps: 670.30 (r/w/o: 469.40/35.30/165.60) lat (ms,95%): 325.98 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 4 tps: 48.40 qps: 967.10 (r/w/o: 676.70/52.20/238.20) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 4 tps: 67.00 qps: 1339.70 (r/w/o: 937.60/72.60/329.50) lat (ms,95%): 95.81 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 4 tps: 65.40 qps: 1310.51 (r/w/o: 917.61/70.20/322.70) lat (ms,95%): 101.13 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 4 tps: 65.50 qps: 1309.00 (r/w/o: 916.60/70.90/321.50) lat (ms,95%): 94.10 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            53634
        write:                           4134
        other:                           18852
        total:                           76620
    transactions:                        3831   (31.90 per sec.)
    queries:                             76620  (638.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      31.9002
    time elapsed:                        120.0934s
    total number of events:              3831

Latency (ms):
         min:                                   36.74
         avg:                                  125.37
         max:                                 1229.49
         95th percentile:                      450.77
         sum:                               480281.42

Threads fairness:
    events (avg/stddev):           957.7500/6.91
    execution time (avg/stddev):   120.0704/0.02